In [3]:
import pandas as pd
import numpy as np
import sqlite3

In [37]:
users = pd.read_csv('data/Users.csv')
churn = pd.read_csv('data/Churn.csv')
daily_listening_activity = pd.read_csv('data/DailyListeningActivity.csv')
feature_exposure = pd.read_csv('data/FeatureExposure.csv')

feature_exposure = feature_exposure[['user_id', 'exposed']]

subscriptions = pd.read_csv('data/Subscriptions.csv')

In [38]:
daily_listening_activity.count()

user_id              60000
date_listened        60000
sessions             60000
minutes_listened     60000
songs_streamed       60000
playlists_created    60000
dtype: int64

In [39]:
import sqlite3

conn = sqlite3.connect("analysis.db")

users.to_sql("users", conn, if_exists="replace", index=False)
daily_listening_activity.to_sql("daily_listening_activity", conn, if_exists="replace", index=False)
feature_exposure.to_sql("feature_exposure", conn, if_exists="replace", index=False)
subscriptions.to_sql("subscriptions", conn, if_exists="replace", index=False)
churn.to_sql("churn_labels", conn, if_exists="replace", index=False)

1000

In [40]:
pd.read_sql("SELECT COUNT(*) FROM users;", conn)

   COUNT(*)
0      1000

In [41]:
pd.read_sql("SELECT COUNT(*) FROM feature_exposure;", conn)

   COUNT(*)
0      1000

In [42]:
pd.read_sql("SELECT COUNT(*) FROM daily_listening_activity;", conn)

   COUNT(*)
0     60000

In [43]:
pd.read_sql("SELECT COUNT(*) FROM subscriptions;", conn)

   COUNT(*)
0        74

In [44]:
pd.read_sql("SELECT COUNT(*) FROM churn_labels;", conn)

   COUNT(*)
0      1000

In [45]:
pd.read_sql("PRAGMA table_info(users);", conn)

   cid                 name  type  notnull dflt_value  pk
0    0              user_id  TEXT        0       None   0
1    1          signup_date  TEXT        0       None   0
2    2  acquisition_channel  TEXT        0       None   0
3    3              country  TEXT        0       None   0
4    4          device_type  TEXT        0       None   0

In [46]:
pd.read_sql("PRAGMA table_info(feature_exposure);", conn)

   cid     name     type  notnull dflt_value  pk
0    0  user_id     TEXT        0       None   0
1    1  exposed  INTEGER        0       None   0

In [50]:
pd.read_sql("PRAGMA table_info(churn_labels);", conn)

   cid         name     type  notnull dflt_value  pk
0    0      user_id     TEXT        0       None   0
1    1  churned_30d  INTEGER        0       None   0

In [53]:
pd.read_sql("PRAGMA table_info(subscriptions);", conn)

   cid            name     type  notnull dflt_value  pk
0    0         user_id     TEXT        0       None   0
1    1  date_purchased     TEXT        0       None   0
2    2      is_premium  INTEGER        0       None   0
3    3         revenue     REAL        0       None   0

In [54]:
pd.read_sql("PRAGMA table_info(daily_listening_activity);", conn)

   cid               name     type  notnull dflt_value  pk
0    0            user_id     TEXT        0       None   0
1    1      date_listened     TEXT        0       None   0
2    2           sessions  INTEGER        0       None   0
3    3   minutes_listened     REAL        0       None   0
4    4     songs_streamed  INTEGER        0       None   0
5    5  playlists_created  INTEGER        0       None   0